#Область Механизм

Функция НастройкиМеханизма() Экспорт
	Настройки = А1Э_Механизмы.НовыйНастройкиМеханизма();
	
	Настройки.Обработчики.Вставить("ОбработкаЗаполнения", Истина);
	
	Настройки.ПорядокВыполнения = 100000000;
	
	Возврат Настройки;
КонецФункции

#Если НЕ Клиент Тогда
	
	Функция ОбработкаЗаполнения(Объект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
		Если НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) И ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.СтруктурнаяЕдиница = Объект.Организация.ОсновнойБанковскийСчет;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ОрганизацияПолучатель) И ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.ОрганизацияПолучатель = Объект.Организация;
		КонецЕсли;
	КонецФункции
	
#КонецЕсли
 
#КонецОбласти

#Если НЕ Клиент Тогда
	Функция ОбработкаПроверкиЗаполненияПеред(Объект, Отказ, ПроверяемыеРеквизиты) Экспорт
		Если НЕ ЗначениеЗаполнено(Объект.ОрганизацияПолучатель) И ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.ОрганизацияПолучатель = Объект.Организация; //По умолчанию организация-получатель это организация.
		КонецЕсли;
	КонецФункции
	
#КонецЕсли
 