
&После("ОбработкаПолученияПолейПредставления")
Процедура А1Бух_ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("Ссылка");
	Поля.Добавить("А1Бух_Представление");
КонецПроцедуры

&После("ОбработкаПолученияПредставления")
Процедура А1Бух_ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Данные.А1Бух_Представление) Тогда
		СтандартнаяОбработка = Ложь;
		Представление = Данные.А1Бух_Представление;
	КонецЕсли;
КонецПроцедуры

