Функция НастройкиМеханизма() Экспорт
	Настройки = А1Э_Механизмы.НовыйНастройкиМеханизма();
	
	Настройки.Обработчики.Вставить("А1Э_НастройкиПоискаДублей", Истина);
	
	Возврат Настройки;
КонецФункции

#Если НЕ Клиент Тогда
	
	Функция А1Э_НастройкиПоискаДублей(Настройки) Экспорт
				
		Для Каждого Справочник Из Метаданные.Справочники Цикл
			Если СтрНачинаетсяС(Справочник.Имя, "Удалить") Тогда
				Настройки.Вставить(Справочник.ПолноеИмя(), Ложь); //Не обрабатываем не использующиеся.
				Продолжить;
			КонецЕсли;
			Если Справочник.Реквизиты.Найти("Организация") <> Неопределено Тогда
				Настройки.Вставить(Справочник.ПолноеИмя(), "Организация,Наименование");
			ИначеЕсли СтрНайти(Справочник.ПолноеИмя(), "ПрисоединенныеФайлы") <> 0 Тогда
				Если Справочник.Реквизиты.Найти("ВладелецФайла") <> Неопределено Тогда
					Настройки.Вставить(Справочник.ПолноеИмя(), "ВладелецФайла,Наименование,Размер");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Настройки.Вставить("Справочник.КонтактныеЛица", "Наименование,ОбъектВладелец");
		Настройки.Вставить("Справочник.Контрагенты", "Наименование,ИНН,КПП"); //Должен бы работать поиск по ИНН/КПП, но есть всякие УФК, поэтому перестрахуемся.
		Настройки.Вставить("Справочник.Банки", "Код");
		Настройки.Вставить("Справочник.БанковскиеСчета", "Владелец,НомерСчета");
		Настройки.Вставить("Справочник.ВариантыОтчетов", "Отчет,КлючВарианта");
		Настройки.Вставить("Справочник.ГруппыДоступа", Ложь); //Удалятся сами при настройке пользователей.
		Настройки.Вставить("Справочник.НаборыДополнительныхРеквизитовИСведений", Ложь); //Не знаю точно как все должно работать.
		Настройки.Вставить("Справочник.ОбщероссийскийКлассификаторОсновныхФондов", "Код");
		Настройки.Вставить("Справочник.ПоляФормСтатистики", Ложь); //Непонятны ключи уникальности.
		Настройки.Вставить("Справочник.Сотрудники", Ложь); //Непонятны ключи уникальности, дублей быть не должно.
		Настройки.Вставить("Справочник.ФизическиеЛица", "Фамилия,Имя,Отчество,ДатаРождения");
		Настройки.Вставить("Справочник.ДоговорыКонтрагентов", "Организация,Владелец,Наименование");
		Настройки.Вставить("Справочник.ЦиклыОбмена", Ложь); //Регламентированные данные, дублей быть не должно.
		Настройки.Вставить("Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов", Ложь); //Регламентированные данные, дублей быть не должно.
		Настройки.Вставить("Справочник.Валюты", "Код");
		Настройки.Вставить("Справочник.ПравилаПредставленияОтчетовУплатыНалогов", Ложь);
		Настройки.Вставить("Справочник.ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов", "Код");
		Настройки.Вставить("Справочник.ОсновныеСредства", Ложь); //по ним идет амортизация, дубли маловроятны.
		Настройки.Вставить("Справочник.ВидыВычетовНДФЛ", Ложь); //Предопределенные.
		Настройки.Вставить("Справочник.ПредопределенныеВариантыОтчетов", "Отчет,КлючВарианта");
		Настройки.Вставить("Справочник.ПредопределенныеВариантыОтчетовРасширений", "Отчет,КлючВарианта");
		Настройки.Вставить("Справочник.ТранспорноеСообщениеПрисоединенныеФайлы", Ложь);
		Настройки.Вставить("Справочник.ПерепискаСКонтролирующимиОрганами", Ложь);
		Настройки.Вставить("Справочник.ПерепискаСКонтролирующимиОрганамиПрисоединенныеФайлы", Ложь);
		Настройки.Вставить("Справочник.ИдентификаторыОбъектовМетаданных", Ложь);
		Настройки.Вставить("Справочник.ИдентификаторыОбъектовРасширений", Ложь);
	КонецФункции 
	
#КонецЕсли

