Функция НастройкиМеханизма() Экспорт
	Настройки = А1Э_Механизмы.НовыйНастройкиМеханизма();
	
	Настройки.Обработчики.Вставить("ПриУстановкеНовогоНомера", Истина);
	Настройки.Обработчики.Вставить("ФормаСпискаПриСозданииНаСервере", Истина);
	Настройки.Обработчики.Вставить("ФормаПриОткрытии", Истина);
	
	Возврат Настройки;
КонецФункции

Функция ПриУстановкеНовогоНомера(Объект, СтандартнаяОбработка, Префикс) Экспорт
	Если ЗначениеЗаполнено(Объект.А1Бух_Основание) Тогда
		Префикс = "А1УР--";
	КонецЕсли;
КонецФункции

Функция ФормаСпискаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	Отбор = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.Использование = Истина;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("А1Бух_Основание");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	МассивОписаний = Новый Массив;
	А1Э_Формы.ДобавитьОписаниеКомандыИКнопки2(МассивОписаний, "ПоказатьУниверсальныеРегистраторы", ИмяМодуля() + ".ПоказатьУниверсальныеРегистраторы", "(А1) Показать универсальные регистраторы", А1Э_Формы.КоманднаяПанель(Форма), ,
	А1Э_Структуры.Создать(
	"ТолькоВоВсехДействиях", Истина,
	));
	А1Э_УниверсальнаяФорма.ДобавитьРеквизитыИЭлементы(Форма, МассивОписаний);
КонецФункции 

#Если Клиент Тогда
	
	Функция ФормаПриОткрытии(Форма, Отказ) Экспорт
		Если А1Э_Формы.ТипФормы(Форма) <> "ФормаЭлемента" Тогда Возврат Неопределено; КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Форма.Объект.А1Бух_Основание) Тогда Возврат Неопределено; КонецЕсли;
		
		Значение = А1Э_Метаданные.СсылкаПоИдентификатору(Форма.Объект.А1Бух_Основание);
		Форма.Закрыть();
		ПоказатьЗначение(, Значение);
	КонецФункции 
	
	Функция ПоказатьУниверсальныеРегистраторы(Форма, Команда) Экспорт
		ЭлементыОтбора = Форма.Список.Отбор.Элементы;
		Для Каждого Элемент Из ЭлементыОтбора Цикл
			Если Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("А1Бух_Основание") Тогда
				ЭлементыОтбора.Удалить(Элемент);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецФункции 
	
#КонецЕсли
 
Функция ИмяМодуля() Экспорт
	Возврат "А1Бух_УниверсальныйРегистраторОперацияБух";	
КонецФункции 

