
&Вместо("ПередЗаписью")
Процедура А1Бух_ПередЗаписью(Отказ)
	//В процессе записи может быть выполнено создание контактного лица, которое не проходит по RLS (т. к. контрагент еще не записан). 
	//Отключаем проверки прав чтобы работало.
	УстановитьПривилегированныйРежим(Истина);
	ПродолжитьВызов(Отказ);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если А1Э_СтандартныеТипы.ЭтоБитаяСсылка(ЭтотОбъект.ГоловнойКонтрагент) Тогда
		ЭтотОбъект.ГоловнойКонтрагент = Неопределено;
	КонецЕсли;
КонецПроцедуры
