
&Вместо("ПередОткрытиемФормыОтправкиПисьма")
Процедура А1Бух_ПередОткрытиемФормыОтправкиПисьма(ПараметрыОтправки, ОбработчикЗавершения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыПисьмаПоУмолчанию = ОтправкаПочтовыхСообщенийВызовСервера.ПараметрыПисьмаПоУмолчанию();
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Тема");
	ПараметрыПисьма.Вставить("Вложения");
	ПараметрыПисьма.Вставить("ШаблоныПисьма");
	ПараметрыПисьма.Вставить("АдресПолучателяСкрытойКопии");
	ПараметрыПисьма.Вставить("УдалятьФайлыПослеОтправки");
	ПараметрыПисьма.Вставить("ВыбиратьПолучателей");
	ПараметрыПисьма.Вставить("АдресИсходногоВложения");
	ЗаполнитьЗначенияСвойств(ПараметрыПисьма, ПараметрыОтправки);
	
	Если ПараметрыОтправки.Свойство("Отправитель") Тогда
		Если ЗначениеЗаполнено(ПараметрыОтправки.Отправитель) Тогда
			Отправитель = ПараметрыОтправки.Отправитель;
		Иначе
			Отправитель = ПараметрыПисьмаПоУмолчанию.Отправитель;
		КонецЕсли;
		
		ПараметрыПисьма.Вставить("Отправитель", Отправитель);
	КонецЕсли;
	
	Если ПараметрыОтправки.Свойство("Получатель") Тогда
		ПараметрыПисьма.Вставить("Получатель", ПараметрыОтправки.Получатель);
	КонецЕсли;
	
	Если ПараметрыОтправки.Свойство("Текст") Тогда
		Если ЗначениеЗаполнено(ПараметрыОтправки.Текст) Тогда
			Текст = ПараметрыОтправки.Текст;
		Иначе
			Текст = ПараметрыПисьмаПоУмолчанию.Текст;
		КонецЕсли;
		
		ПараметрыПисьма.Вставить("Текст", Текст);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыПисьма.АдресПолучателяСкрытойКопии) Тогда
		ПараметрыПисьма.АдресПолучателяСкрытойКопии = ПараметрыПисьмаПоУмолчанию.АдресПолучателяСкрытойКопии;
	КонецЕсли;
	//А1 - интеграция с А1Емэйл.
	Если ТипЗнч(Текст) = Тип("Структура") Тогда
		ПараметрыПисьма.Вставить("ТелоНТМЛ", Текст);
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ОтправкаСообщенияБП", ПараметрыПисьма, , , , , ОбработчикЗавершения);
	
КонецПроцедуры
